# Curve Overlap Point Dispose Method

Source: https://www.revitapidocs.com/2026/5da3ff4b-1d3b-e781-535a-db3899bc5238.htm

---

| Curve Overlap Point Dispose Method |
| --- |

Releases all resources used by the CurveOverlapPoint
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public void Dispose()
```

```
Public Sub Dispose
```

```
public:
virtual void Dispose() sealed
```

```
abstract Dispose : unit -> unit
override Dispose : unit -> unit
```

#### Implements

IDisposable Dispose
See Also

#### Reference

CurveOverlapPoint Class Autodesk.Revit.DB Namespace